tmp/iflow_inner/src/main/resources/wsdl/ecPushEvent.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
   <env:Header></env:Header>
   <env:Body>
      <ns2:ExternalEvent xmlns:ns2="com.successfactors.event.notification" xmlns:ns3="http://schemas.xmlsoap.org/soap/envelope/">
         <ns2:externalEventMeta>
            <ns2:externalEventId>fe65ede6-3bff-499d-bb0b-cb15904b0c06</ns2:externalEventId>
            <ns2:sourceArea>ECT</ns2:sourceArea>
            <ns2:publishedAt>1437487451267</ns2:publishedAt>
            <ns2:publishedBy>DEANJ</ns2:publishedBy>
            <ns2:isEffectiveDated>true</ns2:isEffectiveDated>
            <ns2:effectiveStartDate>2015-07-21</ns2:effectiveStartDate>
            <ns2:validity>current</ns2:validity>
            <ns2:postFromTransaction>true</ns2:postFromTransaction>
         </ns2:externalEventMeta>
         <ns2:events>
            <ns2:event>
               <ns2:eventId>1</ns2:eventId>
               <ns2:entity>AssignmentInformation</ns2:entity>
               <ns2:isEffectiveDated>true</ns2:isEffectiveDated>
               <ns2:effectiveStartDate>2015-07-21</ns2:effectiveStartDate>
               <ns2:publishedAt>1437487451064</ns2:publishedAt>
               <ns2:publishedBy>DEANJ</ns2:publishedBy>
               <ns2:validity>current</ns2:validity>
               <ns2:processId>1437487451064</ns2:processId>
               <ns2:postFromTransaction>true</ns2:postFromTransaction>
               <ns2:entityKeys>
                  <ns2:entityKey>
                     <name>assignment</name>
                     <value>HUHU</value>
                  </ns2:entityKey>
                  <ns2:entityKey>
                     <name>seqNumber</name>
                     <value>1</value>
                  </ns2:entityKey>
               </ns2:entityKeys>
               <ns2:params>
                  <ns2:param>
                     <name>changedFields</name>
                     <value></value>
                  </ns2:param>
               </ns2:params>
            </ns2:event>
         </ns2:events>
      </ns2:ExternalEvent>
   </env:Body>
</env:Envelope>